InformationRegisters/ОперацииСПрослеживаемымиТоварами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОперацииСПрослеживаемымиТоварами</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрослеживаемости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокументаВПрослеживаемости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтражениеВОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияВОтчетностиПоПрослеживаемости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПрослеживаемойОперации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РНПТ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентПрослеживаемость</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураПрослеживаемость</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийПрослеживаемости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОшибочныеРеквизитыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОшибочныеРеквизитыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсходныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийИсправленияПоступленияРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИсправленияПоступленияРеализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СогласованноеИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоСУчетомНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммыСвязанныеСРасчетамиПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежиОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыУслугиКомитентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНесырьевые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученныхНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиНеНаТерриторииРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядныеКапстроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапстроительствоНезавершенныхОбъектов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияПоНДСПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНачисленКУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССкорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогИсчисляетПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияПоНДСПокупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПокупки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплаченНДСНаТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНДСНаСтроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСВведеноВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредполагаетсяСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановленНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычету0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССписанНаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогИсчисляетПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычетуВПоследующихПериодахНеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычетуВПоследующихПериодахПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УчетНДСУНФ/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ФормированиеОтчетности

Процедура ДополнитьИнформациейОРНПТ(Знач ДополнительнаяИнформация, Знач СтруктураПараметров, Запрос, ПоискРНПТПоОснованию = Ложь) Экспорт

	Запрос.Текст = ТекстЗапросаДанныеОРНПТДляОтчетности(ПоискРНПТПоОснованию);
	Запрос.УстановитьПараметр("ОтражениеВОтчетности", СтруктураПараметров.ПорядокОтраженияВОтчетностиПоПрослеживаемости);
	Запрос.УстановитьПараметр("Организация",          СтруктураПараметров.СписокОрганизаций);
	Запрос.МенеджерВременныхТаблиц = СтруктураПараметров.МенеджерВременныхТаблиц;
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоДокументам.СчетФактура) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСвРегНом = Новый Массив();
		ВыборкаПоРНПТ = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаПоРНПТ.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(ВыборкаПоРНПТ.РегНомПросл) Тогда
				
				СтруктураСвРегНом = Новый Структура("РегНомПросл,КолТовПросл,СтоимТовПросл,ОКЕИ");
				ЗаполнитьЗначенияСвойств(СтруктураСвРегНом, ВыборкаПоРНПТ);
				МассивСвРегНом.Добавить(СтруктураСвРегНом);
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаДопИнформации = ДополнительнаяИнформация.Найти(ВыборкаПоДокументам.СчетФактура, "Ссылка");
		Если СтрокаДопИнформации = Неопределено Тогда
			СтрокаДопИнформации        = ДополнительнаяИнформация.Добавить();
			СтрокаДопИнформации.Ссылка = ВыборкаПоДокументам.СчетФактура;
		КонецЕсли;
		СтрокаДопИнформации.СвРегНом = МассивСвРегНом;
		
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаДанныеОРНПТДляОтчетности(ПоискРНПТПоОснованию)

	Если ПоискРНПТПоОснованию Тогда
	
		Возврат
		"ВЫБРАТЬ
		|	СписокСчетовФактур.СчетФактура КАК СчетФактура,
		|	ОперацииСПрослеживаемымиТоварами.РНПТ.Код КАК РегНомПросл,
		|	СУММА(ОперацииСПрослеживаемымиТоварами.КоличествоПрослеживаемости) КАК КолТовПросл,
		|	СУММА(ОперацииСПрослеживаемымиТоварами.СуммаБезНДС) КАК СтоимТовПросл,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") КАК ОКЕИ,
		|	1 КАК КоличествоЭлементов
		|ИЗ
		|	СписокСчетовФактур КАК СписокСчетовФактур
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСПрослеживаемымиТоварами КАК ОперацииСПрослеживаемымиТоварами
		|		ПО СписокСчетовФактур.ДокументОснование = ОперацииСПрослеживаемымиТоварами.ДокументОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|		ПО (ОперацииСПрослеживаемымиТоварами.Номенклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка)
		|ГДЕ
		|	ОперацииСПрослеживаемымиТоварами.Организация В(&Организация)
		|	И ОперацииСПрослеживаемымиТоварами.ОтражениеВОтчетности = &ОтражениеВОтчетности
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСПрослеживаемымиТоварами.РНПТ.Код,
		|	СписокСчетовФактур.СчетФактура,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """")
		|ИТОГИ
		|	СУММА(КоличествоЭлементов)
		|ПО
		|	СчетФактура";
		
	Иначе
	
		Возврат
		"ВЫБРАТЬ
		|	СписокСчетовФактур.СчетФактура КАК СчетФактура,
		|	ОперацииСПрослеживаемымиТоварами.РНПТ.Код КАК РегНомПросл,
		|	СУММА(ОперацииСПрослеживаемымиТоварами.КоличествоПрослеживаемости) КАК КолТовПросл,
		|	СУММА(ОперацииСПрослеживаемымиТоварами.СуммаБезНДС) КАК СтоимТовПросл,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") КАК ОКЕИ,
		|	1 КАК КоличествоЭлементов
		|ИЗ
		|	СписокСчетовФактур КАК СписокСчетовФактур
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСПрослеживаемымиТоварами КАК ОперацииСПрослеживаемымиТоварами
		|		ПО СписокСчетовФактур.СчетФактура = ОперацииСПрослеживаемымиТоварами.ДокументОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|		ПО (ОперацииСПрослеживаемымиТоварами.Номенклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка)
		|ГДЕ
		|	ОперацииСПрослеживаемымиТоварами.Организация В(&Организация)
		|	И ОперацииСПрослеживаемымиТоварами.ОтражениеВОтчетности = &ОтражениеВОтчетности
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокСчетовФактур.СчетФактура,
		|	ОперацииСПрослеживаемымиТоварами.РНПТ.Код,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """")
		|ИТОГИ
		|	СУММА(КоличествоЭлементов)
		|ПО
		|	СчетФактура";
		
	КонецЕсли;

КонецФункции

Процедура ДополнитьПокупкиИнформациейОНомерахДекларацийНаТовары(Знач ДополнительнаяИнформация, Знач СтруктураПараметров, Запрос) Экспорт

	Запрос.Текст = ТекстЗапросаИнформацияПоТаможеннымДекларациямПокупки();
	СтрокаСФ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока СтрокаСФ.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаСФ.СчетФактура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИнформации = "";
		
		СтрокаДопИнформации = ДополнительнаяИнформация.Найти(СтрокаСФ.СчетФактура, "Ссылка");
		Если СтрокаДопИнформации = Неопределено Тогда
			СтрокаДопИнформации        = ДополнительнаяИнформация.Добавить();
			СтрокаДопИнформации.Ссылка = СтрокаСФ.СчетФактура;
		КонецЕсли;
		
		СтрокаСтраныПроисхождения = СтрокаСФ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока СтрокаСтраныПроисхождения.Следующий() Цикл
			СтрокаИнформации = СтрокаИнформации 
			+ ?(ПустаяСтрока(СтрокаИнформации), "", Символы.ПС) + СокрЛП(СтрокаСтраныПроисхождения.СтранаПроисхождения);
			ГТДРез = "";
			СтрокаНомерГТД = СтрокаСтраныПроисхождения.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока СтрокаНомерГТД.Следующий() Цикл 
				ГТДРез = ГТДРез + ?(ГТДРез = "","",", ") + СокрЛП(СтрокаНомерГТД.НомерГТД);
				
				Если Найти(СтрокаДопИнформации.ГТД, СокрЛП(СтрокаНомерГТД.НомерГТД)) = 0 Тогда // Исключаем дубли номеров ГТД
					СтрокаДопИнформации.ГТД = СтрокаДопИнформации.ГТД 
					+ ?(ПустаяСтрока(СтрокаДопИнформации.ГТД), "", ";") + СокрЛП(СтрокаНомерГТД.НомерГТД);
				КонецЕсли;
				
				Если Найти(СтрокаДопИнформации.РегистрационныйНомерТД, СокрЛП(СтрокаНомерГТД.РегистрационныйНомерТД)) = 0 Тогда
					СтрокаДопИнформации.РегистрационныйНомерТД = СтрокаДопИнформации.РегистрационныйНомерТД
					+ ?(ПустаяСтрока(СтрокаДопИнформации.РегистрационныйНомерТД), "", ";")
					+ СокрЛП(СтрокаНомерГТД.РегистрационныйНомерТД);
				КонецЕсли;
				
			КонецЦикла;
			СтрокаИнформации = СтрокаИнформации 
			+ ?(ПустаяСтрока(СтрокаИнформации), "", ?(ПустаяСтрока(ГТДРез), "", ";")) + ГТДРез;
		КонецЦикла;
		СтрокаДопИнформации.ГТДиСтрана = СтрокаИнформации;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьИнформациейОПосредникахИПлатежах(Знач ДополнительнаяИнформация, Знач СтруктураПараметров, 
		Запрос, ТекстЗапросаРеквизитыКонтрагентовДокументовОплаты) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаПродавцы.СчетФактураДокумент КАК СчетФактураДокумент,
	|	НАЧАЛОПЕРИОДА(ТаблицаПродавцы.СчетФактураДата, ДЕНЬ) КАК ДатаСведений,
	|	ТаблицаПродавцы.ПродавецСсылка КАК Ссылка,
	|	ТаблицаПродавцы.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ТаблицаПродавцы.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента
	|ПОМЕСТИТЬ СсылкиНаДаты
	|ИЗ
	|	(" + ТекстЗапросаРеквизитыКонтрагентовДокументовОплаты + ") КАК ТаблицаПродавцы
	|";

	Запрос.Выполнить();
	УчетНДСПереопределяемый.РегистрационныеСведенияНаДаты(СтруктураПараметров.МенеджерВременныхТаблиц);
	Запрос.Текст = ТекстЗапросаРеквизитыКонтрагентовДокументовОплаты();
	СтрокаСФ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Запрос.МенеджерВременныхТаблиц = Неопределено;

	Пока СтрокаСФ.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаСФ.СчетФактураДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаГрафа9 = "";
		СтрокаГрафа10 = "";
		МассивСвПрод = Новый Массив();
		МассивПлатежныеДокументы = Новый Массив();
		
		СтрокаДетальнойИнформации = СтрокаСФ.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока СтрокаДетальнойИнформации.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(СтрокаДетальнойИнформации.ДатаДокументаОплаты)
				И ЗначениеЗаполнено(СтрокаДетальнойИнформации.НомерДокументаОплаты) Тогда
				
				РеквизитыПлатежногоДокумента = Новый Структура("НомерДокументаОплаты,ДатаДокументаОплаты");
				ЗаполнитьЗначенияСвойств(РеквизитыПлатежногоДокумента, СтрокаДетальнойИнформации);
				МассивПлатежныеДокументы.Добавить(РеквизитыПлатежногоДокумента);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаДетальнойИнформации.Продавец) Тогда
				СтрокаГрафа9 = ?(ПустаяСтрока(СтрокаГрафа9), "", СтрокаГрафа9 + ";" + Символы.ПС) 
				+ СокрЛП(СтрокаДетальнойИнформации.Продавец);
				
				СтрокаГрафа10 = ?(ПустаяСтрока(СтрокаГрафа10), "", СтрокаГрафа10 + ";" + Символы.ПС) 
				+ СокрЛП(СтрокаДетальнойИнформации.ИНН) 
				+ ?(ПустаяСтрока(СтрокаДетальнойИнформации.КПП), "", "/" + СокрЛП(СтрокаДетальнойИнформации.КПП));
				
				СтруктураРеквизитовКонтрагента = Новый Структура();
				
				Если СтрокаДетальнойИнформации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
					СтруктураРеквизитовКонтрагента.Вставить("ИННФЛ", СтрокаДетальнойИнформации.ИНН);
				Иначе
					СтруктураРеквизитовКонтрагента.Вставить("ИННЮЛ", СтрокаДетальнойИнформации.ИНН);
					СтруктураРеквизитовКонтрагента.Вставить("КПП",   СтрокаДетальнойИнформации.КПП);
				КонецЕсли;
				
				СтруктураРеквизитовКонтрагента.Вставить("КонтрагентНаименование", СтрокаДетальнойИнформации.Продавец);
				СтруктураРеквизитовКонтрагента.Вставить("Контрагент",             СтрокаДетальнойИнформации.ПродавецСсылка);
				МассивСвПрод.Добавить(СтруктураРеквизитовКонтрагента);
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаДопИнформации = ДополнительнаяИнформация.Найти(СтрокаСФ.СчетФактураДокумент, "Ссылка");
		Если СтрокаДопИнформации = Неопределено Тогда
			СтрокаДопИнформации        = ДополнительнаяИнформация.Добавить();
			СтрокаДопИнформации.Ссылка = СтрокаСФ.СчетФактураДокумент;
		КонецЕсли;
		
		СтрокаДопИнформации.Графа9  = СтрокаГрафа9;
		СтрокаДопИнформации.Графа10 = СтрокаГрафа10;
		СтрокаДопИнформации.МассивСвПрод = МассивСвПрод;
		СтрокаДопИнформации.МассивПлатежныеДокументы = МассивПлатежныеДокументы;
		
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаРеквизитыКонтрагентовДокументовОплаты()
	
	Возврат
	"ВЫБРАТЬ
	|	ОшибочныеРеквизитыКонтрагентов.СчетФактура КАК СчетФактура,
	|	ОшибочныеРеквизитыКонтрагентов.Контрагент КАК Контрагент,
	|	ОшибочныеРеквизитыКонтрагентов.ИНН КАК ИНН,
	|	ОшибочныеРеквизитыКонтрагентов.КПП КАК КПП
	|ПОМЕСТИТЬ ОшибочныеРеквизитыКонтрагентов
	|ИЗ
	|	РегистрСведений.ОшибочныеРеквизитыКонтрагентов.СрезПоследних(, Организация В (&Организация)) КАК ОшибочныеРеквизитыКонтрагентов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДаты.СчетФактураДокумент КАК СчетФактураДокумент,
	|	СсылкиНаДаты.Ссылка КАК ПродавецСсылка,
	|	ЕСТЬNULL(СведенияОСсылкахНаДаты.Наименование, """") КАК Продавец,
	|	ВЫБОР
	|		КОГДА НЕ ОшибочныеРеквизитыКонтрагентов.ИНН ЕСТЬ NULL
	|			ТОГДА ОшибочныеРеквизитыКонтрагентов.ИНН
	|		ИНАЧЕ ЕСТЬNULL(СведенияОСсылкахНаДаты.ИНН, """")
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА НЕ ОшибочныеРеквизитыКонтрагентов.КПП ЕСТЬ NULL
	|			ТОГДА ОшибочныеРеквизитыКонтрагентов.КПП
	|		ИНАЧЕ ЕСТЬNULL(СведенияОСсылкахНаДаты.КПП, """")
	|	КОНЕЦ КАК КПП,
	|	СсылкиНаДаты.ДатаПлатежногоДокумента КАК ДатаДокументаОплаты,
	|	СсылкиНаДаты.НомерПлатежногоДокумента КАК НомерДокументаОплаты,
	|	СУММА(1) КАК КоличествоЭлементов,
	|	СсылкиНаДаты.Ссылка.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОСсылкахНаДаты КАК СведенияОСсылкахНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОСсылкахНаДаты.Ссылка
	|			И СсылкиНаДаты.ДатаСведений = СведенияОСсылкахНаДаты.ДатаСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОшибочныеРеквизитыКонтрагентов КАК ОшибочныеРеквизитыКонтрагентов
	|		ПО СсылкиНаДаты.СчетФактураДокумент = ОшибочныеРеквизитыКонтрагентов.СчетФактура
	|			И СсылкиНаДаты.Ссылка = ОшибочныеРеквизитыКонтрагентов.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	СсылкиНаДаты.Ссылка,
	|	СсылкиНаДаты.СчетФактураДокумент,
	|	ЕСТЬNULL(СведенияОСсылкахНаДаты.Наименование, """"),
	|	ВЫБОР
	|		КОГДА НЕ ОшибочныеРеквизитыКонтрагентов.ИНН ЕСТЬ NULL
	|			ТОГДА ОшибочныеРеквизитыКонтрагентов.ИНН
	|		ИНАЧЕ ЕСТЬNULL(СведенияОСсылкахНаДаты.ИНН, """")
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОшибочныеРеквизитыКонтрагентов.КПП ЕСТЬ NULL
	|			ТОГДА ОшибочныеРеквизитыКонтрагентов.КПП
	|		ИНАЧЕ ЕСТЬNULL(СведенияОСсылкахНаДаты.КПП, """")
	|	КОНЕЦ,
	|	СсылкиНаДаты.ДатаПлатежногоДокумента,
	|	СсылкиНаДаты.НомерПлатежногоДокумента,
	|	СсылкиНаДаты.Ссылка.ЮридическоеФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продавец УБЫВ
	|ИТОГИ
	|	СУММА(КоличествоЭлементов)
	|ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОСсылкахНаДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СсылкиНаДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОшибочныеРеквизитыКонтрагентов";

КонецФункции

Функция ТекстЗапросаИнформацияПоТаможеннымДекларациямПокупки()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.Ссылка КАК СчетФактура,
	|	ТаблицаТоваров.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	ТаблицаТоваров.НомерГТД.Код КАК НомерГТД,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер КАК РегистрационныйНомерТД,
	|	СУММА(1) КАК КоличествоЭлементов
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	|		ПО ТаблицаТоваров.Ссылка = СписокСчетовФактур.СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.СтранаПроисхождения,
	|	ТаблицаТоваров.НомерГТД,
	|	ТаблицаТоваров.НомерГТД.Код,
	|	ТаблицаТоваров.СтранаПроисхождения.Код,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.СтранаПроисхождения.Код,
	|	ТаблицаТоваров.НомерГТД.Код,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер,
	|	СУММА(1)
	|ИЗ
	|	Документ.КорректировкаПоступления.Запасы КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	|		ПО ТаблицаТоваров.Ссылка = СписокСчетовФактур.СчетФактура
	|ГДЕ
	|	ТаблицаТоваров.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|	И НЕ ТаблицаТоваров.Ссылка.ИсправляемыйДокументПоступления ССЫЛКА Документ.КорректировкаПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.СтранаПроисхождения,
	|	ТаблицаТоваров.НомерГТД,
	|	ТаблицаТоваров.НомерГТД.Код,
	|	ТаблицаТоваров.СтранаПроисхождения.Код,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер";
	
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаТоваров.Ссылка,
	//|	ТаблицаТоваров.СтранаПроисхождения.Код,
	//|	ТаблицаТоваров.НомерГТД.Код,
	//|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер,
	//|	СУММА(1)
	//|ИЗ
	//|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаТоваров
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	//|		ПО ТаблицаТоваров.Ссылка = СписокСчетовФактур.СчетФактура
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаТоваров.Ссылка,
	//|	ТаблицаТоваров.СтранаПроисхождения,
	//|	ТаблицаТоваров.НомерГТД,
	//|	ТаблицаТоваров.НомерГТД.Код,
	//|	ТаблицаТоваров.СтранаПроисхождения.Код,
	//|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаТоваров.СчетФактура,
	//|	ТаблицаТоваров.Номенклатура.СтранаПроисхождения.Код,
	//|	ТаблицаТоваров.НомерГТД.Код,
	//|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер,
	//|	СУММА(1)
	//|ИЗ
	//|	Документ.АвансовыйОтчет.Запасы КАК ТаблицаТоваров
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	//|		ПО (ВЫБОР
	//|				КОГДА СписокСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	//|					ТОГДА ВЫРАЗИТЬ(СписокСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).УдалитьДокументОснование = ТаблицаТоваров.Ссылка
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаТоваров.СчетФактура,
	//|	ТаблицаТоваров.СтранаПроисхождения,
	//|	ТаблицаТоваров.НомерГТД,
	//|	ТаблицаТоваров.НомерГТД.Код,
	//|	ТаблицаТоваров.СтранаПроисхождения.Код,
	//|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер
	//|ИТОГИ
	//|	СУММА(КоличествоЭлементов)
	//|ПО
	//|	СчетФактура,
	//|	СтранаПроисхождения";
	
КонецФункции

Процедура ДополнитьИнформациейОТНВЭД(Знач ДополнительнаяИнформация, Знач Запрос) Экспорт

	Запрос.Текст = ТекстЗапросаИнформацияПоТНВЭД();
	
	СтрокаСФ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока СтрокаСФ.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаСФ.СчетФактура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДопИнформации = ДополнительнаяИнформация.Найти(СтрокаСФ.СчетФактура, "Ссылка");
		Если СтрокаДопИнформации = Неопределено Тогда
			СтрокаДопИнформации        = ДополнительнаяИнформация.Добавить();
			СтрокаДопИнформации.Ссылка = СтрокаСФ.СчетФактура;
		КонецЕсли;
		
		СтрокаДетальныеЗаписи = СтрокаСФ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока СтрокаДетальныеЗаписи.Следующий() Цикл 
			Если ЗначениеЗаполнено(СтрокаДетальныеЗаписи.КодТНВЭД)
				И Найти(СтрокаДопИнформации.ТНВЭД, СокрЛП(СтрокаДетальныеЗаписи.КодТНВЭД)) = 0 Тогда // Исключаем дубли ТНВЭД
				СтрокаДопИнформации.ТНВЭД = СтрокаДопИнформации.ТНВЭД 
				+ ?(ПустаяСтрока(СтрокаДопИнформации.ТНВЭД ), "", ";") + СокрЛП(СтрокаДетальныеЗаписи.КодТНВЭД);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьПродажиИнформациейОНомерахДекларацийНаТовары(Знач ДополнительнаяИнформация, Знач СтруктураПараметров, Запрос) Экспорт

	Запрос.Текст = ТекстЗапросаИнформацияПоТаможеннымДекларациямПродажи();
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоДокументам.СчетФактура) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСвРегНом = Новый Массив();
		ВыборкаПоРегНомерамТД = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаПоРегНомерамТД.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(ВыборкаПоРегНомерамТД.РегистрационныйНомер) Тогда
				
				СтруктураСвРегНом = Новый Структура("РегНомПросл,КолТовПросл,СтоимТовПросл,ОКЕИ");
				СтруктураСвРегНом.РегНомПросл = ВыборкаПоРегНомерамТД.РегистрационныйНомер;
				МассивСвРегНом.Добавить(СтруктураСвРегНом);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(МассивСвРегНом) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДопИнформации = ДополнительнаяИнформация.Найти(ВыборкаПоДокументам.СчетФактура, "Ссылка");
		Если СтрокаДопИнформации = Неопределено Тогда
			СтрокаДопИнформации        = ДополнительнаяИнформация.Добавить();
			СтрокаДопИнформации.Ссылка = ВыборкаПоДокументам.СчетФактура;
		КонецЕсли;
		СтрокаДопИнформации.СвРегНомТД = МассивСвРегНом;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаИнформацияПоТНВЭД()
	
	// Запрос уменьшен для БРУ
	
	Возврат
	"ВЫБРАТЬ
	|	СписокСчетовФактур.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ СчетаФактурыВЕАЭС
	|ИЗ
	|	СписокСчетовФактур КАК СписокСчетовФактур
	|ГДЕ
	|	СписокСчетовФактур.УчастникЕАЭС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА ТаблицаТоваров.КодТНВЭД.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодТНВЭД,
	|	СУММА(1) КАК КоличествоЭлементов
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыВЕАЭС КАК СчетаФактуры
	|		ПО ТаблицаТоваров.Ссылка = СчетаФактуры.СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА ТаблицаТоваров.КодТНВЭД.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИТОГИ
	|	СУММА(КоличествоЭлементов)
	|ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаФактурыВЕАЭС";

КонецФункции

Функция ТекстЗапросаИнформацияПоТаможеннымДекларациямПродажи()
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка КАК СчетФактура,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер КАК РегистрационныйНомер,
	|	1 КАК КоличествоЭлементов
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	|		ПО ТаблицаТоваров.Ссылка = СписокСчетовФактур.СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.НомерГТД.РегистрационныйНомер,
	|	1
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
	|		ПО ТаблицаТоваров.Ссылка = СписокСчетовФактур.СчетФактура
	|ИТОГИ
	|	СУММА(КоличествоЭлементов)
	|ПО
	|	СчетФактура";

КонецФункции

Процедура ПреобразоватьПоказателиРНПТКСторнирующейЗаписи(Знач МассивСвРегНом) Экспорт

	Перем ЭлементМассива;

	Для Каждого ЭлементМассива Из МассивСвРегНом Цикл
		Если ЗначениеЗаполнено(ЭлементМассива.КолТовПросл) 
			Или ЗначениеЗаполнено(ЭлементМассива.СтоимТовПросл) Тогда // Для обычных товаров количество и сумма = Неопределено
			ЭлементМассива.КолТовПросл   = - ЭлементМассива.КолТовПросл;
			ЭлементМассива.СтоимТовПросл = - ЭлементМассива.СтоимТовПросл;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаПодготовкаСведенийРНПТЖурнал() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	ЗаписиРегистраЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ПредварительныйСписокСчетовФактур
	|ИЗ
	|	ВТ_ЖурналУчетаСчетовФактур КАК ЗаписиРегистраЖурналУчетаСчетовФактур
	|ГДЕ
	|	НЕ ЗаписиРегистраЖурналУчетаСчетовФактур.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаписиРегистраЖурналУчетаСчетовФактур.СчетФактураКомитентаПродавца
	|ИЗ
	|	ВТ_ЖурналУчетаСчетовФактур КАК ЗаписиРегистраЖурналУчетаСчетовФактур
	|ГДЕ
	|	НЕ ЗаписиРегистраЖурналУчетаСчетовФактур.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйСписокСчетовФактур.СчетФактура КАК СчетФактура,
	|	ПредварительныйСписокСчетовФактур.СчетФактура КАК ДокументОснование
	|ПОМЕСТИТЬ СписокСчетовФактур
	|ИЗ
	|	ПредварительныйСписокСчетовФактур КАК ПредварительныйСписокСчетовФактур
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредварительныйСписокСчетовФактур.СчетФактура,
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ИЗ
	|	ПредварительныйСписокСчетовФактур КАК ПредварительныйСписокСчетовФактур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ПредварительныйСписокСчетовФактур.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредварительныйСписокСчетовФактур.СчетФактура,
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование
	|ИЗ
	|	ПредварительныйСписокСчетовФактур КАК ПредварительныйСписокСчетовФактур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ПредварительныйСписокСчетовФактур.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование";
	
КонецФункции



#КонецОбласти 

#Область ФормированиеДвижений   

Функция ПустаяТаблицаРегистраНакопления(ИмяРегистра) Экспорт

	ПустаяТаблица = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПустаяТаблица.Колонки.Удалить("Регистратор");
	ПустаяТаблица.Колонки.Удалить("МоментВремени");
	ПустаяТаблица.Колонки.Удалить("Активность");
	Если ПустаяТаблица.Колонки.Найти("ВидДвижения") <> Неопределено Тогда
		ПустаяТаблица.Колонки.Удалить("ВидДвижения");
	КонецЕсли;

	Возврат ПустаяТаблица;

КонецФункции  

Процедура СформироватьДвиженияНДСЗаписиКнигиПродажРеализацияТоваровУслуг(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	
	Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Контрагент");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	&Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаЗапасы.КорректируемыйДокумент, Шапка.КорректируемыйДокумент) КАК КорректируемыйДокумент,
	|	ТаблицаЗапасы.СуммаНДСВалютаДокумента КАК СуммаНДСВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Шапка.НДСВключатьВСтоимость
	|			ТОГДА ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДСВалютаДокумента
	|		ИНАЧЕ ТаблицаЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТаблицаЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВременнаяТаблицаШапка КАК Шапка,
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы";
	
	ТоварыУслуги  = Запрос.Выполнить().Выгрузить();
	
	Если ТоварыУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВерсияУчетаНДС = УчетНДСКлиентСервер.Версия(ДокументСсылка.Дата);
	ПлательщикНДС  = УчетнаяПолитика.ПлательщикНДС(ДокументСсылка.Организация, ДокументСсылка.Дата);
	
	ТаблицаЗаписиКнигиПродаж = ПустаяТаблицаРегистраНакопления("НДСЗаписиКнигиПродаж");
	
	Для каждого СтрокаТаблицы Из ТоварыУслуги Цикл
		
		Если ВерсияУчетаНДС > 1 И СтрокаТаблицы.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗаписиКнигиПродаж.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.Покупатель  = СтрокаТаблицы.Контрагент;
		НоваяСтрока.СуммаБезНДС = СтрокаТаблицы.СуммаБезНДС;
		НоваяСтрока.НДС         = СтрокаТаблицы.СуммаНДСВалютаДокумента; 
		НоваяСтрока.СтавкаНДС   = СтрокаТаблицы.СтавкаНДС;
	    НоваяСтрока.ВидЦенности   = Перечисления.ВидыЦенностей.Товары;
	КонецЦикла;
	
	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(ДокументСсылка.Организация, "Организация");
	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(ДокументСсылка.Дата,      "Период");
	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(ДокументСсылка.Дата,      "ДатаСобытия");
	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(ДокументСсылка, "СчетФактура");
	
	//Если Реквизиты.НДСИсчисляетсяНалоговымАгентом = Истина
	//   И УчетНДС.ВедетсяУчетНДСПоФЗ335(Реквизиты.Период) Тогда
	//	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПродажи.НалогИсчисляетПокупатель, "Событие");
	//Иначе
		ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПродажи.Реализация, "Событие");
	//КонецЕсли;
	
	// Для операций поступления/реализации договор не заполняется
	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), "ДоговорКонтрагента");

	ТаблицаЗаписиКнигиПродаж.Свернуть("Период,Организация,Покупатель,СчетФактура,ВидЦенности,СтавкаНДС,
		|ДатаОплаты,ДокументОплаты,Событие,ДатаСобытия,ДоговорКонтрагента",
		"СуммаБезНДС,НДС"); 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСЗаписиКнигиПродаж", ТаблицаЗаписиКнигиПродаж);
	
 КонецПроцедуры
 
 
Процедура СформироватьДвиженияНДСЗаписиКнигиПокупокПоступлениеТоваровУслуг(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 	
	Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Контрагент");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	&Контрагент КАК Поставщик,
	|	ЕСТЬNULL(ТаблицаЗапасы.КорректируемыйДокумент, Шапка.КорректируемыйДокумент) КАК КорректируемыйДокумент,
	|	ТаблицаЗапасы.СуммаНДСВалютаДокумента КАК СуммаНДСВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Шапка.НДСВключатьВСтоимость
	|			ТОГДА ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДСВалютаДокумента
	|		ИНАЧЕ ТаблицаЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТаблицаЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВременнаяТаблицаШапка КАК Шапка,
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы";
	
	ТоварыУслуги  = Запрос.Выполнить().Выгрузить();
	
	Если ТоварыУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВерсияУчетаНДС = УчетНДСКлиентСервер.Версия(ДокументСсылка.Дата);
	ПлательщикНДС  = УчетнаяПолитика.ПлательщикНДС(ДокументСсылка.Организация, ДокументСсылка.Дата);
	
	ТаблицаЗаписиКнигиПокупок = ПустаяТаблицаРегистраНакопления("НДСЗаписиКнигиПокупок");
	
	Для каждого СтрокаТаблицы Из ТоварыУслуги Цикл
		
		Если ВерсияУчетаНДС > 1 И СтрокаТаблицы.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗаписиКнигиПокупок.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.Поставщик  = СтрокаТаблицы.Поставщик;
		НоваяСтрока.СуммаБезНДС = СтрокаТаблицы.СуммаБезНДС;
		НоваяСтрока.НДС         = СтрокаТаблицы.СуммаНДСВалютаДокумента; 
		НоваяСтрока.СтавкаНДС   = СтрокаТаблицы.СтавкаНДС;
	    НоваяСтрока.ВидЦенности   = Перечисления.ВидыЦенностей.Товары;
	КонецЦикла;
	
	ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(ДокументСсылка.Организация, "Организация");
	ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(ДокументСсылка.Дата,      "Период");
	ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(ДокументСсылка.Дата,      "ДатаСобытия");
	ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(ДокументСсылка, "СчетФактура");
	
	//Если Реквизиты.НДСИсчисляетсяНалоговымАгентом = Истина
	//   И УчетНДС.ВедетсяУчетНДСПоФЗ335(Реквизиты.Период) Тогда
	//	ТаблицаЗаписиКнигиПродаж.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПродажи.НалогИсчисляетПокупатель, "Событие");
	//Иначе
		ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету, "Событие");
	//КонецЕсли;
	
	// Для операций поступления/реализации договор не заполняется
	ТаблицаЗаписиКнигиПокупок.ЗаполнитьЗначения(Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), "ДоговорКонтрагента");

	ТаблицаЗаписиКнигиПокупок.Свернуть("Период,Организация,Поставщик,СчетФактура,ВидЦенности,СтавкаНДС,
		|ДатаОплаты,ДокументОплаты,Событие,ДатаСобытия,ДоговорКонтрагента",
		"СуммаБезНДС,НДС"); 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСЗаписиКнигиПокупок", ТаблицаЗаписиКнигиПокупок);
	
 КонецПроцедуры 
 
#КонецОбласти

// Функция получает дату начала действия постановления 1137 по НДС
//
Функция ПолучитьДатуНачалаДействияПостановления1137() Экспорт
	
	Возврат('20120401');
	
КонецФункции

#КонецОбласти
